Repository: zeroy1024/Swift-Craft-Launcher
Catalog: SwiftCraftLauncher/Resources/Localizable.xcstrings
Source language: en
Languages: ar, da, de, es, fi, fr, hi, it, ja, ko, nb, nl, pl, pt, ru, sv, th, tr, vi, zh_hans, zh_hant

# yggdrasil.server.select
source: Select Yggdrasil skin server for sign-in
ar: اختر خادم Yggdrasil لتسجيل الدخول بالجلد
da: Vælg Yggdrasil-skinsserver til login
de: Wählen Sie einen Yggdrasil-Skin-Server für die Anmeldung
es: Selecciona un servidor de skins Yggdrasil para iniciar sesión
fi: Valitse Yggdrasil-skini-palvelin kirjautumista varten
fr: Sélectionnez un serveur de skins Yggdrasil pour la connexion
hi: लॉगिन के लिए Yggdrasil स्किन सर्वर चुनें
it: Seleziona un server delle skin Yggdrasil per l'accesso
ja: ログインに使用するYggdrasilスキンサーバーを選択してください
ko: 로그인에 사용할 Yggdrasil 스킨 서버를 선택하세요
nb: Velg Yggdrasil-skinserver for innlogging
nl: Selecteer een Yggdrasil-skinserver voor inloggen
pl: Wybierz serwer skórek Yggdrasil do logowania
pt: Selecione um servidor de skins Yggdrasil para login
ru: Выберите сервер скинов Yggdrasil для входа
sv: Välj en Yggdrasil-skinserver för inloggning
th: เลือกเซิร์ฟเวอร์สกิน Yggdrasil สำหรับการเข้าสู่ระบบ
tr: Oturum açmak için bir Yggdrasil skin sunucusu seçin
vi: Chọn máy chủ skin Yggdrasil để đăng nhập
zh_hans: 选择Yggdrasil登录皮肤站
zh_hant: 選擇Yggdrasil登入皮膚站

# saveinfo.litematica
source: Litematica
zh_hans: 投影文件
zh_hant: 投影檔案

# yggdrasil.auth.method.oauth
source: OAuth
zh_hans: 浏览器登录
zh_hant: 瀏覽器登入

# yggdrasil.auth.remember_password.help
source: Stored in the macOS Keychain so the launcher can re-login automatically if the token expires.
zh_hans: 保存在 macOS 钥匙串中，token 失效后可自动重新登录。
zh_hant: 保存在 macOS 鑰匙圈中，token 失效後可自動重新登入。

# yggdrasil.server.change
source: Change Server
zh_hans: 更换服务器
zh_hant: 更換伺服器

# yggdrasil.server.custom.add
source: Add Custom Authlib Server…
zh_hans: 添加自定义 Authlib 服务器…
zh_hant: 新增自訂 Authlib 伺服器…

# yggdrasil.server.custom.api_root
source: Authlib API Root
zh_hans: Authlib API 地址
zh_hant: Authlib API 位址

# yggdrasil.server.custom.api_root.help
source: Example: https://example.com/api/yggdrasil — password login only.
zh_hans: 例如：https://example.com/api/yggdrasil。仅支持用户名密码登录。
zh_hant: 例如：https://example.com/api/yggdrasil。僅支援使用者名稱密碼登入。

# yggdrasil.server.custom.invalid_url
source: Enter a valid http(s) Authlib API root.
zh_hans: 请输入有效的 http(s) Authlib API 地址。
zh_hant: 請輸入有效的 http(s) Authlib API 位址。

# yggdrasil.server.custom.name
source: Display Name (optional)
zh_hans: 显示名称（可选）
zh_hant: 顯示名稱（可選）

# yggdrasil.server.custom.remove
source: Remove This Server
zh_hans: 删除此服务器
zh_hant: 刪除此伺服器

# yggdrasil.server.custom.save
source: Save & Use
zh_hans: 保存并使用
zh_hant: 儲存並使用

# yggdrasil.server.custom.save_failed
source: Failed to save the custom server.
zh_hans: 保存自定义服务器失败。
zh_hant: 儲存自訂伺服器失敗。

# yggdrasil.server.custom.title
source: Custom Authlib-Injector Server
zh_hans: 自定义 Authlib-Injector 服务器
zh_hant: 自訂 Authlib-Injector 伺服器

# yggdrasil.server.section.custom
source: Custom
zh_hans: 自定义
zh_hant: 自訂

# yggdrasil.server.section.presets
source: Built-in
zh_hans: 内置
zh_hant: 內建
